import React from 'react'
// import PropTypes from 'prop-types'; // Імпортуємо модуль PropTypes для визначення типів властивостей

const FavouriteIcon = ({ classes }) => {
  return (
    <svg
      className={classes}
      xmlns="http://www.w3.org/2000/svg"
      viewBox="0 0 44 44"
    >
      <path
        d="M37.2791 23.896L25.1075 36.0697C24.3006 36.8764 23.2062 37.3296 22.0652 37.3296C20.9241 37.3296 19.8298 36.8764 19.0228 36.0697L6.85131 23.8982C5.84516 22.9008 5.04592 21.7145 4.49947 20.4074C3.95302 19.1004 3.67012 17.6982 3.66702 16.2815C3.66392 14.8648 3.94067 13.4614 4.48139 12.1519C5.02211 10.8425 5.81615 9.6527 6.81792 8.65093C7.81969 7.64916 9.00946 6.85512 10.3189 6.3144C11.6284 5.77368 13.0318 5.49692 14.4485 5.50003C15.8652 5.50313 17.2673 5.78602 18.5744 6.33247C19.8815 6.87893 21.0678 7.67817 22.0652 8.68431C24.091 6.70888 26.8136 5.61113 29.6431 5.62886C32.4726 5.64659 35.1812 6.77837 37.1822 8.77903C39.1831 10.7797 40.3153 13.4881 40.3334 16.3177C40.3516 19.1472 39.2542 21.8699 37.2791 23.896Z"
        fill="#fff"
        stroke="#1B1B1B"
        strokeWidth="3"
        strokeLinecap="round"
        strokeLinejoin="round"
      />
    </svg>

    // <svg className={classes} viewBox="0 0 122.88 117.1" xmlns="http://www.w3.org/2000/svg">
    //     {/* Відображаємо SVG іконку, яка може бути стилізована за допомогою CSS-класу classes */}
    //     <path
    //         d="m64.42 2 15.71 36.7 39.87 3.56a3.2 3.2 0 0 1 1.82 5.62l-30.18 26.3 8.9 39a3.19 3.19 0 0 1 -2.42 3.82 3.27 3.27 0 0 1 -2.46-.46l-34.25-20.44-34.34 20.54a3.18 3.18 0 0 1 -4.38-1.09 3.14 3.14 0 0 1 -.37-2.38l8.91-39-30.14-26.29a3.24 3.24 0 0 1 -.32-4.52 3.32 3.32 0 0 1 2.29-1l39.72-3.56 15.71-36.8a3.24 3.24 0 0 1 5.93 0z"
    //         fill="#fff" /> {/* Відображаємо шлях для іконки */}
    // </svg>
  )
}

// FavouriteIcon.propTypes = {
//     classes: PropTypes.string // Властивість classes має бути рядком, використовується для стилізації іконки
// }

FavouriteIcon.defaultProps = {
  classes: '', // За замовчуванням значення властивості classes - порожній рядок
}

export default FavouriteIcon // Експортуємо компонент FavouriteIcon
